InformationRegisters/фин_НастройкаСоответствийДляИзмеренийБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>фин_НастройкаСоответствийДляИзмеренийБюджетирования</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Соответствие</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсходноеЗначение</Name>
					<Type>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разрез</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/фин_НастройкаСоответствийДляИзмеренийБюджетирования/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	фин_ПроцедурыМеханизмовБюджетирования.ЗаполнитьСписокРеквизитовБюджетирования(СписокВыбораРазрезов,Истина);
	Если Запись.ИсходныйКлючЗаписи.Пустой() И Параметры.ЗначениеКопирования.Период = '00010101' Тогда
		Если Параметры.Свойство("Период") Тогда
			Запись.Период = Параметры.Период;
		КонецЕсли;
		Если Параметры.Свойство("ИсходноеЗначение") Тогда
			Запись.ИсходноеЗначение = Параметры.ИсходноеЗначение;
		КонецЕсли;
		Если Параметры.Свойство("Разрез") Тогда
			Запись.Разрез = Параметры.Разрез;
		КонецЕсли;
		Если Параметры.Свойство("Соответствие") Тогда
			Запись.Соответствие = Параметры.Соответствие;
		КонецЕсли;
		Если Параметры.Свойство("ТипЗначения") Тогда
			Элементы.ИсходноеЗначение.ОграничениеТипа = Параметры.ТипЗначения;	
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Запись.Разрез) Тогда
		РазрезПредставление = СписокВыбораРазрезов.НайтиПоЗначению(фин_РаботаСДополнительнымиРазрезамиБюджетирования.ИмяРазреза(Запись.Разрез)).Представление;
		Элементы.Соответствие.ОграничениеТипа = фин_ПроцедурыМеханизмовБюджетирования.ПолучитьОписаниеТиповДляРазрезаБюджетирования(Запись.Разрез);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазрезНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = СписокВыбораРазрезов;
КонецПроцедуры

&НаКлиенте
Процедура РазрезОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Запись.Разрез = ПредопределенноеЗначение("Перечисление.фин_ФактическиеПоказателиБюджетирования."+ВыбранноеЗначение);
	РазрезПредставление = СписокВыбораРазрезов.НайтиПоЗначению(ВыбранноеЗначение).Представление;
	РазрезОбработкаВыбораНаСервере();
КонецПроцедуры

&НаСервере
Процедура РазрезОбработкаВыбораНаСервере()
	Элементы.Соответствие.ОграничениеТипа = фин_ПроцедурыМеханизмовБюджетирования.ПолучитьОписаниеТиповДляРазрезаБюджетирования(Запись.Разрез);
	Запись.Соответствие = Элементы.Соответствие.ОграничениеТипа.ПривестиЗначение(Запись.Соответствие);
КонецПроцедуры
